// Метод forEach() выполняет функцию для каждого элемента массива.

// array.forEach(function(element, index, array) {
//     // Ваш код
//   });
//   element — текущий элемент массива.
//   index (необязательно) — индекс текущего элемента.
//   array (необязательно) — сам массив.

// forEach() — Вывести элементы массива:

// Задача: Есть массив чисел [1, 2, 3, 4]. Пройдитесь по массиву с помощью метода forEach() и выведите каждый элемент в консоль.

const numbers = [1, 2, 3, 4, 5];
numbers.forEach((num) => console.log(num));
